# Languages
brew 'deno'
brew 'go'
brew 'node@22'
brew 'nushell'
brew 'openjdk'
brew 'pnpm'
brew 'postgresql'
brew 'python@3.14'
brew 'sqlite'
brew 'typst'
brew 'zsh'

# Tools
brew 'btop'
brew 'cargo-binstall'
brew 'cmake'
brew 'curl'
brew 'difftastic'
brew 'direnv'
brew 'docker-buildx'
brew 'duti'
brew 'ffmpeg'
brew 'gallery-dl'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'git-lfs'
# brew 'handbrake'
brew 'htop'
brew 'mongodb/brew/mongodb-community'
brew 'mongosh'
brew 'mprocs'
brew 'neofetch'
brew 'neovim'
brew 'openssl'
brew 'shellcheck'
brew 'tree'
brew 'virtualenv'
brew 'weave'
brew 'wget'
brew 'yt-dlp'

# Casks
cask '1password'
cask 'blender'
cask 'brave-browser'
cask 'discord'
cask 'docker-desktop'
cask 'figma'
cask 'google-drive'
cask 'herd'
cask 'iina'
cask 'iterm2'
cask 'linear-linear'
cask 'modrinth'
cask 'mongodb-compass'
cask 'mos'
cask 'nordvpn'
# cask 'notion'
# cask 'obs'
cask 'plexamp'
# cask 'postman'
# cask 'qbittorrent'
cask 'raycast'
cask 'shottr'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'tableplus'
brew 'tw93/tap/mole'
# cask 'visual-studio-code'
# cask 'vlc'
cask 'zed'

# Fonts
cask 'font-0xproto-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-inter'
cask 'font-lilex-nerd-font'
cask 'font-meslo-lg-nerd-font'

# Go tools
go 'golang.org/x/tools/gopls'
go 'honnef.co/go/tools/cmd/staticcheck'
