# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'

# Brew Formulae
brew 'bat'
brew 'brotli'
brew 'cmake'
brew 'composer'
brew 'curl'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'hub'
brew 'mackup'
brew 'mas'
brew 'neofetch'
brew 'nvm'
brew 'openssl'
brew 'stow'
brew 'svn'
brew 'telnet'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'

# Languages
brew 'elixir'
brew 'erlang'
brew 'go'
brew 'python'
brew 'sqlite'

# Valet
# brew 'dnsmasq', restart_service: true
# brew 'mariadb', restart_service: true
# brew 'nginx', restart_service: true
# brew 'php', restart_service: true
# brew 'postgresql', restart_service: true
# brew 'redis', restart_service: true

# Cask Apps
cask 'alfred'
cask 'blender'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
# cask 'homebrew/cask-drivers/wacom-tablet'
# cask 'homebrew/cask-versions/sublime-text-dev'
cask 'iterm2'
cask 'ngrok'
cask 'postman'
cask 'spotify'
cask 'tableplus'
cask 'visual-studio-code'
cask 'vlc'
# cask 'zotero'

# Fonts
cask 'font-anonymous-pro'
cask 'font-fira-code'
cask 'font-ibm-plex-mono'
cask 'font-inter'
cask 'font-lato'
cask 'font-menlo-for-powerline'
cask 'font-meslo-lg-nerd-font'
cask 'font-open-sans'
cask 'font-roboto-mono-nerd-font'
cask 'font-roboto-mono'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas '1Password 7 - Password Manager', id: 1333542190
mas 'Bear', id: 1091189122
mas 'Contrast', id: 1254981365
mas 'Magnet', id: 441258766
mas 'NordVPN IKE', id: 1116599239
# mas 'The Unarchiver', id: 425424353
