# Languages
brew 'deno'
brew 'go'
brew 'node'
brew 'pnpm'
brew 'sqlite'
brew 'zsh'

# Tools
brew 'btop'
brew 'cargo-binstall'
brew 'curl'
brew 'ffmpeg'
brew 'gallery-dl'
brew 'gcc'
brew 'gh'
brew 'git-lfs'
brew 'git'
brew 'htop'
brew 'mongosh'
brew 'mprocs'
brew 'neofetch'
brew 'neovim'
brew 'nushell'
brew 'openssl'
brew 'stow'
brew 'wget'
brew 'yt-dlp'
brew "mongodb/brew/mongodb-community"

# Cask Apps
cask '1password'
cask 'blender'
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'google-drive'
cask 'herd'
cask 'iina'
cask 'iterm2'
cask 'linear-linear'
cask 'modrinth'
cask 'mongodb-compass'
cask 'nordvpn'
cask 'notion'
cask 'obs'
cask 'plexamp'
cask 'postman'
cask 'qbittorrent'
cask 'raycast'
cask 'shottr'
# cask 'spacedrive'
cask 'spotify'
cask 'stats'
cask 'steam'
cask 'tableplus'
# cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-inter'
cask 'font-meslo-lg-nerd-font'
