tap 'homebrew-ffmpeg/ffmpeg', trusted: true
tap 'mongodb/brew', trusted: true
tap 'tw93/tap', trusted: true

# Languages
brew 'deno'
brew 'go'
brew 'node@24'
brew 'nushell'
brew 'openjdk'
brew 'pnpm'
brew 'postgresql@18'
brew 'python@3.14'
brew 'sqlite'
brew 'typst'
brew 'zsh'

# Tools
brew 'btop'
brew 'cargo-binstall'
brew 'cmake'
brew 'curl'
brew 'direnv'
brew 'docker-buildx'
brew 'duti'
brew 'gallery-dl'
brew 'gcc'
brew 'gdu'
brew 'gh'
brew 'gifski'
brew 'git'
brew 'git-filter-repo'
brew 'git-lfs'
# brew 'handbrake'
brew 'htop'
brew 'just'
brew 'mongosh'
brew 'mprocs'
brew 'neofetch'
brew 'neovim'
brew 'openssl'
brew 'shellcheck'
brew 'stow'
brew 'tree'
brew 'tree-sitter'
brew 'virtualenv'
brew 'wget'
brew 'yt-dlp'

# Custom formulae
brew 'homebrew-ffmpeg/ffmpeg/ffmpeg', args: ['with-zimg']
brew 'mongodb/brew/mongodb-community'
brew 'tw93/tap/mole'

# Casks
cask '1password'
cask 'blender'
cask 'helium-browser'
cask 'discord'
cask 'docker-desktop'
cask 'figma'
cask 'ghostty'
cask 'google-drive'
cask 'herd'
cask 'iina'
cask 'linear'
cask 'modrinth'
cask 'mongodb-compass'
cask 'mos'
cask 'nordvpn'
# cask 'obs'
cask 'plexamp'
# cask 'postman'
# cask 'qbittorrent'
cask 'raycast'
cask 'shottr'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'tableplus'
cask 'zed'

# Fonts
cask 'font-0xproto-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-inter'
cask 'font-lilex-nerd-font'
cask 'font-meslo-lg-nerd-font'

# Go
go 'golang.org/x/tools/gopls'
go 'honnef.co/go/tools/cmd/staticcheck'

# Cargo
cargo 'cargo-bloat'
cargo 'cargo-bundle'
cargo 'cargo-clean-all'
cargo 'cargo-outdated'
cargo 'cargo-watch'
cargo 'tree-sitter-cli'
cargo 'typeshare-cli'
